In [1]:
import numpy as np
import pandas as pd

In [2]:
dis1 = {
  "name": ['Niraj','nishant','ashant'],
    "age":[23,23,23]
}

In [3]:
df = pd.DataFrame(dis1)

In [4]:
df

      name  age
0    Niraj   23
1  nishant   23
2   ashant   23

In [5]:
df.head(2)

      name  age
0    Niraj   23
1  nishant   23

In [6]:
df.tail(2)

      name  age
1  nishant   23
2   ashant   23

In [7]:
df.describe()

        age
count   3.0
mean   23.0
std     0.0
min    23.0
25%    23.0
50%    23.0
75%    23.0
max    23.0

In [11]:
ser = pd.Series(np.random.rand(15))